/*
*********************************************************************************************************
*
*	模块名称 : 电池监测模块
*	文件名称 : battery.c
*	版    本 : V1.0
*	说    明 : 电池电压与充电状态监测
*
*	修改记录 :
*		版本号    日期        作者     说明
*		V1.0    2020/04/28   孟凡忠  正式发布
*
*	Copyright (C), 2015-2020, 华宏软件
*
*********************************************************************************************************
*/
#include "bsp.h"
#include "battery.h"


BATTERY_T g_battery_t;		/* 定义全局变量 */

// static void bsp_InitKeyVar(void);

/*
*********************************************************************************************************
*	函 数 名: Battery_InitHard
*	功能说明: 初始化电池充电状态与电量检测硬件接口(GPIO与ADC)。
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void Battery_InitHard(void)
{
	bsp_InitCharge();			/* 初始化充电状态GPIO口 */
	bsp_InitADC();				/* 初始化电量检测ADC */
}

/*
*********************************************************************************************************
*	函 数 名: Battery_Scan
*	功能说明: 定时扫描电池状态
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void Battery_Scan(void)
{
	s32 result;
	u32 value = 0;
	/* 判断是否在充电 */
	if( bsp_getChargeState() )
		g_battery_t.charge = CHARGE;		/* 正在充电 */
	else
		g_battery_t.charge = NOT_CHARGE;	/* 没有充电 */

	APP_DEBUG("<--- CHARGE = %d--->\r\n",g_battery_t.charge);

	/* 读取ADC值,计算电池电量 */
	result = bsp_SingleReadADC( &value );
	if( result == QL_ADC_STATUS_OK )
	{
		g_battery_t.level = value;
		APP_DEBUG("<---bsp_SingleReadADC voltage = %d(mV)--->\r\n",value);
	}
	else
	{
		APP_DEBUG("<---bsp_SingleReadADC false = %d--->\r\n",result);
	}
	

}

/*********************************** 华宏软件 (END OF FILE) ********************************************/


