/*
*********************************************************************************************************
*
*	模块名称 : 按键驱动模块
*	文件名称 : bsp_charge.h
*	说    明 : 头文件
*
*	Copyright (C), 2015-2020, 华宏软件
*
*********************************************************************************************************
*/

#ifndef __BSP_CHARGE_H
#define __BSP_CHARGE_H



/* 供外部调用的函数声明 */
void bsp_InitCharge(void);
u8 bsp_getChargeState(void);

#endif

/***************************** 华宏软件 (END OF FILE) *********************************/

