/*
*********************************************************************************************************
*
*	模块名称 : ADC驱动模块
*	文件名称 : bsp_adc.h
*	说    明 : 头文件
*
*	Copyright (C), 2015-2020, 华宏软件
*
*********************************************************************************************************
*/

#ifndef __BSP_ADC_H
#define __BSP_ADC_H



/* 供外部调用的函数声明 */
void bsp_InitADC( void );		
s32 bsp_SingleReadADC( u32 *value );

/* 供外部调用的变量声明 */

#endif

/***************************** 华宏软件 (END OF FILE) *********************************/

