/*
*********************************************************************************************************
*
*	模块名称 : SPI总线驱动
*	文件名称 : bsp_spi_bus.h
*	版    本 : V1.0
*	说    明 : 头文件
*
*	Copyright (C), 2013-2020, 华宏软件 
*
*********************************************************************************************************
*/

#ifndef __BSP_SPI_BUS_H
#define __BSP_SPI_BUS_H

//#define SOFT_SPI		/* 定义此行表示使用GPIO模拟SPI接口 */

/* 供外部调用的函数声明 */
void    bsp_InitSPIBus(void);
u8      bsp_spiWrite(u8 _ucByte);
u8      bsp_spi_Read(void);
u8      bsp_spi_WriteRead(u8 *pwrBuf, u32 wrLen, u8 * prdBuf, u32 rdLen);


#endif

/**************************************** 华宏软件 (END OF FILE) ****************************************/
