/*
*********************************************************************************************************
*
*	模块名称 : 按键驱动模块
*	文件名称 : bsp_key.c
*	版    本 : V1.0
*	说    明 : 扫描按键
*
*	修改记录 :
*		版本号    日期        作者     说明
*		V1.0    2020/04/21   孟凡忠  正式发布
*
*	Copyright (C), 2015-2020, 华宏软件
*
*********************************************************************************************************
*/
#include "bsp.h"
#include "bsp_charge.h"

#define CHARGE_PINNAME PINNAME_GPIO2

/*
*********************************************************************************************************
*	函 数 名: bsp_InitCharge
*	功能说明: 初始化充电状态引脚
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitCharge(void)
{
    /* 初始化充电状态引脚 ( 输入,带上拉 ) */
    Ql_GPIO_Init(CHARGE_PINNAME, PINDIRECTION_IN, PINLEVEL_HIGH, PINPULLSEL_PULLDOWN);
    APP_DEBUG("<-- Initialize CHARGE_PINNAME pin : input, HIGH level, PULL DOWN -->\r\n");
}

/*
*********************************************************************************************************
*	函 数 名: bsp_getChargeState
*	功能说明: 获取充电状态
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
u8 bsp_getChargeState(void)
{
    /* 低电平表示按键按下 */
    if (Ql_GPIO_GetLevel(CHARGE_PINNAME) == 0) 
		return 1; 
    else 
		return 0; 
}

/*********************************** 华宏软件 (END OF FILE) ********************************************/


